Repository: filippofinke/cad-studio
Catalog: CADStudio/Resources/Localizable.xcstrings
Source language: it
Languages: de, en, fr

source: %@ ha terminato con un errore (codice %d).
de: %@ wurde mit einem Fehler beendet (Code %d).
en: %@ ended with an error (code %d).
fr: %@ s’est arrêté avec une erreur (code %d).

source: %@ non trovato
de: %@ nicht gefunden
en: %@ not found
fr: %@ introuvable

source: %@ non è autenticato. Apri il Terminale ed esegui `%@` per effettuare l’accesso.
de: %@ ist nicht angemeldet. Öffne das Terminal und führe `%@` aus, um dich anzumelden.
en: %@ isn't signed in. Open Terminal and run `%@` to sign in.
fr: %@ n’est pas connecté. Ouvrez le Terminal et lancez `%@` pour vous connecter.

source: %@ non è installato oppure non è stato trovato. Installalo o indica il percorso dell’eseguibile.
de: %@ ist nicht installiert oder wurde nicht gefunden. Installiere es oder gib den Pfad zur ausführbaren Datei an.
en: %@ isn't installed or couldn't be found. Install it or set the path to the executable.
fr: %@ n’est pas installé ou est introuvable. Installez-le ou indiquez le chemin de l’exécutable.

source: %@ scrive lo script CAD, genera il modello 3D e la tavola tecnica.
de: %@ schreibt das CAD-Skript und erzeugt das 3D-Modell und die technische Zeichnung.
en: %@ writes the CAD script and generates the 3D model and the technical drawing.
fr: %@ écrit le script CAO et génère le modèle 3D et le dessin technique.

source: %@ sta lavorando…
de: %@ arbeitet…
en: %@ is working…
fr: %@ travaille…

source: %@ sta lavorando… · %@
de: %@ arbeitet… · %@
en: %@ is working… · %@
fr: %@ travaille… · %@

source: %@ sta ragionando…
de: %@ denkt nach…
en: %@ is thinking…
fr: %@ réfléchit…

source: %@ sta scrivendo…
de: %@ schreibt…
en: %@ is writing…
fr: %@ écrit…

source: %@ · %lld righe
de: %@ · %lld Zeilen
en: %@ · %lld lines
fr: %@ · %lld lignes

source: %lld colori
de: %lld Farben
en: %lld colors
fr: %lld couleurs

source: %lld immagini
de: %lld Bilder
en: %lld images
fr: %lld images

source: Accesso a %@ richiesto
de: Anmeldung bei %@ erforderlich
en: Sign-in to %@ required
fr: Connexion à %@ requise

source: Adatta
de: Einpassen
en: Fit
fr: Ajuster

source: Adatta alla finestra
de: An Fenster anpassen
en: Fit to Window
fr: Ajuster à la fenêtre

source: Adatta alla vista
de: An Ansicht anpassen
en: Fit to View
fr: Ajuster à la vue

source: Agente
de: Agent
en: Agent
fr: Agent

source: Agente:
de: Agent:
en: Agent:
fr: Agent :

source: Aggiorna il piano di lavoro
de: Aktualisiert den Arbeitsplan
en: Updates the task plan
fr: Met à jour le plan de travail

source: Aggiornamento di pip…
de: pip wird aktualisiert …
en: Updating pip…
fr: Mise à jour de pip…

source: Aggiungi alla coda
de: Zur Warteschlange hinzufügen
en: Add to queue
fr: Ajouter à la file

source: Aggiungi alla coda: partirà al termine (Invio)
de: Zur Warteschlange: wird gesendet, sobald diese fertig ist (Return)
en: Add to queue: it goes out when this one finishes (Return)
fr: Ajouter à la file : partira à la fin (Retour)

source: Allega
de: Anhängen
en: Attach
fr: Joindre

source: Allega file
de: Dateien anhängen
en: Attach files
fr: Joindre des fichiers

source: Allega immagini
de: Bilder anhängen
en: Attach images
fr: Joindre des images

source: Allega immagini di riferimento
de: Referenzbilder anhängen
en: Attach reference images
fr: Joindre des images de référence

source: Allega immagini o file di riferimento (puoi anche incollarli con ⌘V)
de: Referenzbilder oder -dateien anhängen (du kannst sie auch mit ⌘V einfügen)
en: Attach reference images or files (you can also paste them with ⌘V)
fr: Joindre des images ou fichiers de référence (vous pouvez aussi les coller avec ⌘V)

source: Alto
de: Oben
en: Top
fr: Dessus

source: Alto, più accurato
de: Hoch, gründlicher
en: High, more thorough
fr: Élevé, plus approfondi

source: Analizza il modello
de: Analysiert das Modell
en: Analyzing the model
fr: Analyse le modèle

source: Anima il movimento di questo meccanismo con una simulazione fisica.
de: Animiere die Bewegung dieses Mechanismus mit einer Physiksimulation.
en: Animate how this mechanism moves, with a physics simulation.
fr: Anime le mouvement de ce mécanisme avec une simulation physique.

source: Animazione
de: Animation
en: Animation
fr: Animation

source: Annulla
de: Abbrechen
en: Cancel
fr: Annuler

source: Apri
de: Öffnen
en: Open
fr: Ouvrir

source: Apri il Terminale
de: Terminal öffnen
en: Open Terminal
fr: Ouvrir le Terminal

source: Apri il file 3MF nello slicer predefinito
de: 3MF-Datei im Standard-Slicer öffnen
en: Open the 3MF file in the default slicer
fr: Ouvrir le fichier 3MF dans le slicer par défaut

source: Apri in Anteprima
de: In Vorschau öffnen
en: Open in Preview
fr: Ouvrir dans Aperçu

source: Apri in slicer
de: Im Slicer öffnen
en: Open in Slicer
fr: Ouvrir dans le slicer

source: Apri progetto esistente…
de: Vorhandenes Projekt öffnen …
en: Open Existing Project…
fr: Ouvrir un projet existant…

source: Apri progetto…
de: Projekt öffnen …
en: Open Project…
fr: Ouvrir un projet…

source: Apri recenti
de: Benutzte Projekte
en: Open Recent
fr: Ouvrir les éléments récents

source: Asse
de: Achse
en: Axis
fr: Axe

source: Attuale
de: Aktuell
en: Current
fr: Actuelle

source: Automatico
de: Automatisch
en: Automatic
fr: Automatique

source: Avanti
de: Weiter
en: Next
fr: Suivant

source: Avanzate
de: Erweitert
en: Advanced
fr: Avancé

source: Bash limitato
de: Eingeschränkte Bash
en: Restricted Bash
fr: Bash restreint

source: Basso, più veloce
de: Niedrig, schneller
en: Low, faster
fr: Faible, plus rapide

source: Benvenuto in CAD Studio
de: Willkommen bei CAD Studio
en: Welcome to CAD Studio
fr: Bienvenue dans CAD Studio

source: CAD Studio usa %@ installato su questo Mac. Installalo dal Terminale con uno dei comandi seguenti, poi esegui `%@` per effettuare l’accesso.
de: CAD Studio verwendet das auf diesem Mac installierte %@. Installiere es im Terminal mit einem der folgenden Befehle und führe dann `%@` aus, um dich anzumelden.
en: CAD Studio uses the %@ installed on this Mac. Install it from Terminal with one of the commands below, then run `%@` to sign in.
fr: CAD Studio utilise %@ installé sur ce Mac. Installez-le depuis le Terminal avec l’une des commandes ci-dessous, puis lancez `%@` pour vous connecter.

source: CAD Studio usa l’agente installato su questo Mac e il tuo piano. Puoi cambiarlo in qualsiasi momento: i progetti esistenti continuano con l’agente scelto qui.
de: CAD Studio verwendet den auf diesem Mac installierten Agenten und deinen Plan. Du kannst jederzeit wechseln: Bestehende Projekte laufen mit dem hier gewählten Agenten weiter.
en: CAD Studio uses the agent installed on this Mac and your plan. You can switch at any time: existing projects continue with the agent chosen here.
fr: CAD Studio utilise l’agent installé sur ce Mac et votre forfait. Vous pouvez en changer à tout moment : les projets existants continuent avec l’agent choisi ici.

source: CAD Studio usa un ambiente Python dedicato con build123d, matplotlib e numpy per generare modelli e tavole tecniche. L’installazione scarica circa 200 MB.
de: CAD Studio verwendet eine eigene Python-Umgebung mit build123d, matplotlib und numpy, um Modelle und technische Zeichnungen zu erzeugen. Die Installation lädt etwa 200 MB herunter.
en: CAD Studio uses a dedicated Python environment with build123d, matplotlib and numpy to generate models and technical drawings. The installation downloads about 200 MB.
fr: CAD Studio utilise un environnement Python dédié avec build123d, matplotlib et numpy pour générer les modèles et les dessins techniques. L’installation télécharge environ 200 Mo.

source: Cancella menu
de: Menü löschen
en: Clear Menu
fr: Effacer le menu

source: Centimetri (cm)
de: Zentimeter (cm)
en: Centimeters (cm)
fr: Centimètres (cm)

source: Cerca nel progetto
de: Durchsucht das Projekt
en: Searching the project
fr: Cherche dans le projet

source: Cerca sul web
de: Sucht im Web
en: Searching the web
fr: Cherche sur le web

source: Chat a destra
de: Chat rechts
en: Chat on the Right
fr: Discussion à droite

source: Chat a sinistra
de: Chat links
en: Chat on the Left
fr: Discussion à gauche

source: Chat in basso
de: Chat unten
en: Chat at the Bottom
fr: Discussion en bas

source: Chiedi all’agente di correggere
de: Den Agenten um eine Korrektur bitten
en: Ask the agent to fix it
fr: Demander à l’agent de corriger

source: Chiedi all’agente di simulare e animare il meccanismo
de: Den Agenten bitten, den Mechanismus zu simulieren und zu animieren
en: Ask the agent to simulate and animate the mechanism
fr: Demander à l’agent de simuler et d’animer le mécanisme

source: Chiudi
de: Schließen
en: Close
fr: Fermer

source: Codex lavora nella sua sandbox: può scrivere solo nella cartella del progetto e non usa la rete.
de: Codex arbeitet in seiner Sandbox: Es darf nur im Projektordner schreiben und hat keinen Netzwerkzugriff.
en: Codex works in its sandbox: it can only write inside the project folder and has no network access.
fr: Codex travaille dans son bac à sable : il ne peut écrire que dans le dossier du projet et n’accède pas au réseau.

source: Compila il modello
de: Erstellt das Modell
en: Building the model
fr: Construit le modèle

source: Compila modello
de: Modell erstellen
en: Build Model
fr: Générer le modèle

source: Compila modello (⌘B)
de: Modell erstellen (⌘B)
en: Build Model (⌘B)
fr: Générer le modèle (⌘B)

source: Compilazione di model.py…
de: model.py wird ausgeführt …
en: Building model.py…
fr: Exécution de model.py…

source: Compilazione interrotta
de: Erstellung abgebrochen
en: Build stopped
fr: Génération interrompue

source: Compilazione manuale di model.py
de: Manuelle Ausführung von model.py
en: Manual build of model.py
fr: Génération manuelle de model.py

source: Componenti installati
de: Komponenten installiert
en: Components installed
fr: Composants installés

source: Comprimi i parametri
de: Parameter einklappen
en: Collapse parameters
fr: Réduire les paramètres

source: Con Bash limitato l’agente può eseguire solo l’interprete Python dell’ambiente di CAD Studio e alcuni comandi di sola lettura (ls, cat, head…). È più sicuro, ma l’agente ha meno autonomia per diagnosticare i problemi e alcuni tentativi potrebbero essere rifiutati.
de: Mit eingeschränkter Bash kann der Agent nur den Python-Interpreter der CAD-Studio-Umgebung und einige schreibgeschützte Befehle (ls, cat, head …) ausführen. Das ist sicherer, aber der Agent kann Probleme weniger selbstständig untersuchen und manche Versuche werden möglicherweise abgelehnt.
en: With restricted Bash the agent can only run the Python interpreter of the CAD Studio environment and a few read-only commands (ls, cat, head…). It’s safer, but the agent has less freedom to diagnose problems and some attempts may be denied.
fr: Avec Bash restreint, l’agent ne peut exécuter que l’interpréteur Python de l’environnement CAD Studio et quelques commandes en lecture seule (ls, cat, head…). C’est plus sûr, mais l’agent a moins d’autonomie pour diagnostiquer les problèmes et certaines tentatives peuvent être refusées.

source: Configura l’agente…
de: Agent einrichten…
en: Set up the agent…
fr: Configurer l’agent…

source: Confronta con
de: Vergleichen mit
en: Compare with
fr: Comparer avec

source: Continua
de: Weiter
en: Continue
fr: Continuer

source: Controlla i risultati
de: Prüft die Ergebnisse
en: Checking the results
fr: Vérifie les résultats

source: Controlla il disegno
de: Prüft die Zeichnung
en: Checking the drawing
fr: Vérifie le dessin

source: Controlla un'anteprima
de: Prüft eine Vorschau
en: Checking a preview
fr: Vérifie un aperçu

source: Copia
de: Kopieren
en: Copy
fr: Copier

source: Crea
de: Erstellen
en: Create
fr: Créer

source: Crea animazione
de: Animation erstellen
en: Create animation
fr: Créer une animation

source: Crea nuovo progetto…
de: Neues Projekt erstellen …
en: Create New Project…
fr: Créer un nouveau projet…

source: Creazione dell’ambiente virtuale con uv…
de: Virtuelle Umgebung wird mit uv erstellt …
en: Creating the virtual environment with uv…
fr: Création de l’environnement virtuel avec uv…

source: Creazione dell’ambiente virtuale…
de: Virtuelle Umgebung wird erstellt …
en: Creating the virtual environment…
fr: Création de l’environnement virtuel…

source: Descrivi l’oggetto o la modifica…
de: Beschreibe das Objekt oder die Änderung …
en: Describe the object or the change…
fr: Décrivez l’objet ou la modification…

source: Descrivi un oggetto
de: Beschreibe ein Objekt
en: Describe an object
fr: Décrivez un objet

source: Descrivi un oggetto nella chat per iniziare
de: Beschreibe im Chat ein Objekt, um zu beginnen
en: Describe an object in the chat to get started
fr: Décrivez un objet dans la discussion pour commencer

source: Destra
de: Rechts
en: Right
fr: Droite

source: Dettagli
de: Details
en: Details
fr: Détails

source: Disponibili al termine della generazione
de: Verfügbar, sobald die Generierung fertig ist
en: Available when generation finishes
fr: Disponibles à la fin de la génération

source: Distanza tra le parti
de: Abstand zwischen den Teilen
en: Distance between parts
fr: Distance entre les pièces

source: Distanziale cilindrico Ø 12 mm, alto 15 mm, con foro M3
de: Zylindrischer Abstandhalter Ø 12 mm, 15 mm hoch, mit M3-Bohrung
en: Cylindrical spacer Ø 12 mm, 15 mm tall, with an M3 hole
fr: Entretoise cylindrique Ø 12 mm, hauteur 15 mm, avec un trou M3

source: Effort:
de: Aufwand:

source: Errore di %@
de: %@-Fehler
en: %@ error
fr: Erreur de %@

source: Errore nello script
de: Fehler im Skript
en: Script error
fr: Erreur dans le script

source: Esamina i file
de: Sieht Dateien durch
en: Looking through files
fr: Examine les fichiers

source: Eseguibile:
de: Ausführbare Datei:
en: Executable:
fr: Exécutable :

source: Esiste già una cartella chiamata “%@” in questa posizione.
de: An diesem Ort gibt es bereits einen Ordner namens „%@“.
en: A folder named “%@” already exists in this location.
fr: Un dossier nommé « %@ » existe déjà à cet emplacement.

source: Espandi i parametri
de: Parameter ausklappen
en: Expand parameters
fr: Développer les paramètres

source: Esploso
de: Explosion
en: Exploded
fr: Éclaté

source: Esporta
de: Exportieren
en: Export
fr: Exporter

source: Esporta STEP, 3MF, STL, tavola PDF e model.py in un archivio ZIP (⇧⌘E)
de: STEP, 3MF, STL, PDF-Zeichnung und model.py als ZIP-Archiv exportieren (⇧⌘E)
en: Export STEP, 3MF, STL, PDF drawing and model.py as a ZIP archive (⇧⌘E)
fr: Exporter STEP, 3MF, STL, dessin PDF et model.py dans une archive ZIP (⇧⌘E)

source: Esporta pacchetto
de: Paket exportieren
en: Export Package
fr: Exporter le paquet

source: Esporta pacchetto…
de: Paket exportieren …
en: Export Package…
fr: Exporter le paquet…

source: Esportazione non riuscita
de: Export fehlgeschlagen
en: Export failed
fr: Échec de l’exportation

source: FDM (filamento)
de: FDM (Filament)
en: FDM (filament)
fr: FDM (filament)

source: FDM multimateriale (AMS, MMU)
de: Mehrmaterial-FDM (AMS, MMU)
en: Multi-material FDM (AMS, MMU)
fr: FDM multimatériau (AMS, MMU)

source: Facoltativo, ad esempio Bambu Lab P1S
de: Optional, zum Beispiel Bambu Lab P1S
en: Optional, for example Bambu Lab P1S
fr: Facultatif, par exemple Bambu Lab P1S

source: Fai clic su un punto del modello
de: Klicke auf einen Punkt des Modells
en: Click a point on the model
fr: Cliquez sur un point du modèle

source: Fai clic sul secondo punto
de: Klicke auf den zweiten Punkt
en: Click the second point
fr: Cliquez sur le second point

source: File di output mancanti: %@
de: Fehlende Ausgabedateien: %@
en: Missing output files: %@
fr: Fichiers de sortie manquants : %@

source: Fine
de: Fertig
en: Done
fr: Terminé

source: Finestra di benvenuto
de: Willkommensfenster
en: Welcome Window
fr: Fenêtre de bienvenue

source: Formato di output:
de: Ausgabeformat:
en: Output format:
fr: Format de sortie :

source: Fronte
de: Vorne
en: Front
fr: Face

source: Generale
de: Allgemein
en: General
fr: Général

source: Griglia
de: Raster
en: Grid
fr: Grille

source: Ha ragionato per %lld s
de: %lld s nachgedacht
en: Thought for %lld s
fr: A réfléchi pendant %lld s

source: Ignora le configurazioni personali dell’agente
de: Persönliche Konfiguration des Agenten ignorieren
en: Ignore the agent's personal configuration
fr: Ignorer la configuration personnelle de l’agent

source: Il comando “%@” non è riuscito. Controlla il log per i dettagli.
de: Der Befehl „%@“ ist fehlgeschlagen. Details findest du im Protokoll.
en: The command “%@” failed. Check the log for details.
fr: La commande « %@ » a échoué. Consultez le journal pour plus de détails.

source: Il file 3MF non contiene triangoli.
de: Die 3MF-Datei enthält keine Dreiecke.
en: The 3MF file contains no triangles.
fr: Le fichier 3MF ne contient aucun triangle.

source: Il file 3MF non è leggibile.
de: Die 3MF-Datei kann nicht gelesen werden.
en: The 3MF file can’t be read.
fr: Le fichier 3MF est illisible.

source: Il file STL non contiene triangoli.
de: Die STL-Datei enthält keine Dreiecke.
en: The STL file contains no triangles.
fr: Le fichier STL ne contient aucun triangle.

source: Il file STL non è leggibile.
de: Die STL-Datei kann nicht gelesen werden.
en: The STL file can’t be read.
fr: Le fichier STL est illisible.

source: Impossibile aprire il progetto
de: Projekt kann nicht geöffnet werden
en: Can’t open the project
fr: Impossible d’ouvrir le projet

source: Impossibile avviare %@.
de: %@ konnte nicht gestartet werden.
en: Couldn't start %@.
fr: Impossible de lancer %@.

source: Impossibile creare il progetto
de: Projekt kann nicht erstellt werden
en: Can’t create the project
fr: Impossible de créer le projet

source: Impossibile ripristinare la versione %lld
de: Version %lld kann nicht wiederhergestellt werden
en: Can’t restore version %lld
fr: Impossible de restaurer la version %lld

source: In arancione la forma della versione scelta. Per vederne i colori, ripristinala dal menu Versioni.
de: Orange zeigt die Form der gewählten Version. Um ihre Farben zu sehen, stelle sie im Menü Versionen wieder her.
en: Orange shows the shape of the chosen version. To see its colors, restore it from the Versions menu.
fr: L’orange montre la forme de la version choisie. Pour voir ses couleurs, restaurez-la depuis le menu Versions.

source: In coda, in pausa dopo l’ultimo errore
de: In der Warteschlange, nach dem letzten Fehler pausiert
en: Queued, paused after the last error
fr: En file, en pause après la dernière erreur

source: In coda, partiranno uno alla volta
de: In der Warteschlange, einzeln gesendet
en: Queued, sent one at a time
fr: En file, envoyés un par un

source: Indica come stampi: potrai cambiarlo in qualsiasi momento nelle Impostazioni.
de: Gib an, wie du druckst. Du kannst das jederzeit in den Einstellungen ändern.
en: Tell us how you print. You can change this anytime in Settings.
fr: Indiquez comment vous imprimez. Vous pourrez le modifier à tout moment dans les Réglages.

source: Informazioni su CAD Studio
de: Über CAD Studio
en: About CAD Studio
fr: À propos de CAD Studio

source: Ingrandisci
de: Vergrößern
en: Zoom In
fr: Agrandir

source: Ingrandisci (⌘+)
de: Vergrößern (⌘+)
en: Zoom In (⌘+)
fr: Agrandir (⌘+)

source: Installa
de: Installieren
en: Install
fr: Installer

source: Installa i componenti
de: Installiert Komponenten
en: Installing components
fr: Installe des composants

source: Installazione componenti
de: Komponenten installieren
en: Installing Components
fr: Installation des composants

source: Installazione di build123d, matplotlib e numpy…
de: build123d, matplotlib und numpy werden installiert …
en: Installing build123d, matplotlib and numpy…
fr: Installation de build123d, matplotlib et numpy…

source: Installazione in corso…
de: Installation läuft …
en: Installing…
fr: Installation en cours…

source: Installazione non riuscita
de: Installation fehlgeschlagen
en: Installation failed
fr: Échec de l’installation

source: Interprete:
de: Interpreter:
en: Interpreter:
fr: Interpréteur :

source: Interrompi (⌘.)
de: Stoppen (⌘.)
en: Stop (⌘.)
fr: Arrêter (⌘.)

source: Interrotto
de: Abgebrochen
en: Stopped
fr: Interrompu

source: Invia
de: Senden
en: Send
fr: Envoyer

source: Invia (Invio)
de: Senden (Zeilenschalter)
en: Send (Return)
fr: Envoyer (Retour)

source: Invia ora
de: Jetzt senden
en: Send now
fr: Envoyer maintenant

source: La compilazione di model.py non è riuscita.
de: Die Ausführung von model.py ist fehlgeschlagen.
en: model.py failed to build.
fr: La génération de model.py a échoué.

source: La nuova lingua viene applicata al prossimo avvio di CAD Studio.
de: Die neue Sprache wird beim nächsten Start von CAD Studio übernommen.
en: The new language is applied the next time CAD Studio starts.
fr: La nouvelle langue sera appliquée au prochain lancement de CAD Studio.

source: La sessione precedente non è stata trovata: il contesto della conversazione è ripartito, ma il model.py esistente resta la base del lavoro.
de: Die vorherige Sitzung wurde nicht gefunden: Der Gesprächskontext wurde zurückgesetzt, aber die vorhandene model.py bleibt die Arbeitsgrundlage.
en: The previous session wasn’t found: the conversation context has been reset, but the existing model.py remains the basis of the work.
fr: La session précédente est introuvable : le contexte de la conversation a été réinitialisé, mais le model.py existant reste la base du travail.

source: La sessione precedente è ancora in uso da un altro processo: il contesto della conversazione è ripartito, ma il model.py esistente resta la base del lavoro.
de: Die vorherige Sitzung wird noch von einem anderen Prozess verwendet: Der Gesprächskontext beginnt neu, aber die vorhandene model.py bleibt die Arbeitsgrundlage.
en: The previous session is still in use by another process: the conversation context started over, but the existing model.py is still the basis for the work.
fr: La session précédente est encore utilisée par un autre processus : le contexte de la conversation repart de zéro, mais le model.py existant reste la base du travail.

source: Lavora sul progetto
de: Arbeitet am Projekt
en: Working on the project
fr: Travaille sur le projet

source: Legge un file
de: Liest eine Datei
en: Reading a file
fr: Lit un fichier

source: Lingua di sistema
de: Systemsprache
en: System Language
fr: Langue du système

source: Lingua:
de: Sprache:
en: Language:
fr: Langue :

source: L’agente CAD non carica le tue impostazioni utente (hook, plugin e server MCP di Claude Code, config.toml di Codex), così parte più velocemente e risponde in modo prevedibile. Disattiva se la tua autenticazione dipende da impostazioni utente, ad esempio apiKeyHelper.
de: Der CAD-Agent lädt deine Benutzereinstellungen nicht (Hooks, Plugins und MCP-Server von Claude Code, config.toml von Codex). So startet er schneller und verhält sich vorhersehbar. Schalte das aus, wenn deine Anmeldung von Benutzereinstellungen abhängt, etwa apiKeyHelper.
en: The CAD agent doesn't load your user settings (Claude Code hooks, plugins and MCP servers, Codex config.toml), so it starts faster and behaves predictably. Turn this off if your sign-in depends on user settings, such as apiKeyHelper.
fr: L’agent CAO ne charge pas vos réglages utilisateur (hooks, plugins et serveurs MCP de Claude Code, config.toml de Codex) : il démarre plus vite et se comporte de façon prévisible. Désactivez cette option si votre connexion dépend de réglages utilisateur, par exemple apiKeyHelper.
